Tasks/ПроверитьГабаритныеЧертежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ПроверитьГабаритныеЧертежи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылаКорректировка</Name>
					<Comment>0  данные не заполнены, 1 была, 2 не было</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ИзменениеСтатусаГЧ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыездНаЗамер</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиГабаритныхЧертежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наблюдатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ПроверитьГабаритныеЧертежи/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ГабаритныйЧертеж) Тогда
	
		Элементы.Проект.ТолькоПросмотр 				= Истина;	
		Элементы.ГабаритныйЧертеж.ТолькоПросмотр 	= Истина;	
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НовыйСтатус) Тогда
	
		Элементы.НовыйСтатус.Видимость	= Ложь;	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.БылаКорректировка = 0 Тогда
	
		ПоказатьПредупреждение(, "Не выбрано требование к корректировке.");
		Отказ = Истина;
		Возврат;
	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.АктПриемкиГабаритныхЧертежей") Тогда
		Элементы.БылаКорректировка.СписокВыбора.Добавить(3, "Нет данных для изменения");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеЗамеров");
КонецПроцедуры

&НаКлиенте
Процедура Сохранить_и_Закрыть(Команда)
	Записать();
	Модифицированность = Ложь;
	Оповестить("ИзменениеЗамеров");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Выполнить_и_закрыть(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	
	ЗаписатьВыполнениеНаСервере(Объект.Ссылка);
	Модифицированность = Ложь;
	Оповестить("ИзменениеЗамеров");
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьВыполнениеНаСервере(Ссылка)

	Объект = Ссылка.ПолучитьОбъект();
	Объект.Выполнена = Истина;
	Объект.Записать();

КонецПроцедуры // ЗапмсатьВыполнениеНаСервере()
